[
    {
        "job_title": "Data Scientist",
        "company": "Scry AI, Gurugram",
        "description": [
            "Increased document processing efficiency by implementing a YoloV5 object detection model within the OCR pipeline, achieving 97% accuracy in document identification.",
            "Enhanced the auto KYC product by leveraging NLP libraries to automate customer verification and streamline onboarding. This resulted in faster customer acquisition and improved user experience.",
            "Automated insurance product illustration generation through reverse engineering, eliminating legacy code and boosting processing speed.",
            "Established a robust product onboarding pipeline, significantly improving the efficiency of new product acquisitions."

        ],
        "time_period": "April 2022 - Present"
    },
    {
        "job_title": "Associate Data Scientist",
        "company": "Datakalp, Banglore",
        "description": [
            "Experienced in building robust APIs and data pipelines to handle configuration, deployment, and benchmarking of ML/AI models using FastAPI / Flask frameworks.",
            "Building and maintaining dashboards and other reporting tools to monitor targeting models, and other business metrics relevant to managing core data science products.",
            "Experienced in visually impactful web dashboards, and client reports with Python (Dash/H2O Wave), Tableau, and Powerpoints for product output, performance, and accuracy to understand user behaviour and improve the product."

        ],
        "time_period": "Sep 2021 - Mar 2022"
    },
    {
        "job_title": "AI Developer",
        "company": "Appzlogic, Noida sec-2",
        "description": [
            "Designed, developed, and implemented computer vision and NLP problems using deep Learning and google cloud tools.",
            "Worked closely with the android development team to deploy AI applications.",
            "Build AI models from scratch and convert them into the application program interface."
        ],
        "time_period": "Feb 2021 - Aug 2021"
    }
]